app/controllers/api/v1/registrations_controller.rb

SELECT "users".* FROM "users"
---
  def list
    users=User.all