app/controllers/api/v1/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = 'fdsaf1@fdsaf.com' LIMIT 1
---
  def create

    resource = User.find_for_database_authentication(:email => params[:user][:email])